nc: 3  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 0.75 # layer channel multiple
anchors: 3

backbone:
  [
   [-1, 1, HCFF, [64]],  # 0-P1/innovations

   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 1, SFE, [256]],  # innovations

   [-1, 1, ADown, [256]],  # 3-P3/8
   [-1, 1, SFE, [512]],  # 4

   [-1, 1, ADown, [512]],  # 5-P4/16
   [-1, 1, SFE, [512]],  # 6

   [-1, 1, ADown, [512]],  # 7-P5/32
   [-1, 1, SFE, [512]],  # 8
  ]

head:
  [
   [-1, 1, SPPELAN, [512, 256]],  # 9

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, SFE, [512]],  # 12

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, SFE, [256]],  # 15 (P3/8-small)

   [-1, 1, ADown, [256]],
   [[-1, 12], 1, Concat, [1]],  # cat head P4
   [-1, 1, SFE, [512]],  # 18 (P4/16-medium)

   [-1, 1, ADown, [512]],
   [[-1, 9], 1, Concat, [1]],  # cat head P5
   [-1, 1, SFE, [512]],  # 21 (P5/32-large)

   [[15, 18, 21], 1, DDetect, [nc]],  # DDetect(P3, P4, P5)
  ]
